views/courses/_form.php

SELECT * FROM `sectors`
---
        ]
    ]);

    echo Form::widget([
        'model'=>$model,
        'form'=>$form,
        'columns'=>2,
        'attributes'=>[       // 2 column layout
            'category'=>['type'=>Form::INPUT_DROPDOWN_LIST,'options'=>['placeholder'=>'Enter username...'],'items'=>[ 'LONG' => 'LONG', 'SHORT' => 'SHORT', ]],
            'sector_id'=>['type'=>Form::INPUT_DROPDOWN_LIST, 'options'=>['placeholder'=>'Enter respective sector...'],
                            'items'=>[ArrayHelper::map(Sectors::find()->all(), 'id', 'synonym')]]
        ]
    ]);

SELECT * FROM `sponsorship`
---
        ]
    ]);

     echo Form::widget([       // 2 column layout
        'model'=>$model,
        'form'=>$form,
        'columns'=>2,
        'attributes'=>[
            'sponsorship_id'=>[
                'type'=>Form::INPUT_DROPDOWN_LIST,
                'items'=>[ArrayHelper::map(Sponsorship::find()->all(), 'id', 'type')],
                'options'=>['placeholder'=>'Enter respective sector...'],
                'hint'=>'Training/Course Funding'
            ],
            'venue'=>[
                'type'=>Form::INPUT_TEXT,
                'widgetClass'=>'\kartik\widgets\DatePicker',
                'hint'=>'Place of Event'
            ],
        ]
    ]);